Update grand_strategy.md
